GAP
===

Sage使用GAP计算离散数学,特别是群论。

这有一个关于GAP的`IdGroup`函数的例子,
```py
sage: G = gap('Group((1,2,3)(4,5), (3,4))')
sage: G
Group([ (1,2,3)(4,5), (3,4) ])
sage: G.Center()
Group( () )
sage: G.IdGroup()    
[ 120, 34 ]
sage: G.Order()
120
```


可以在Sage中进行同样的计算,而且不需要明确的调用GAP的接口。
```py
sage: G = PermutationGroup([[(1,2,3),(4,5)],[(3,4)]])
sage: G.center()
Subgroup generated by[()]of (Permutation Group with generators[(3,4), (1,2,3)(4,5)])
sage: G.group_id()    
[120, 34]
sage: n = G.order(); n
120
```


对于某些GAP功能,需要安装一个Sage的可选包。可以通过以下命令来完成
```
sage -i gap_packages
```
